In [27]:
import pandas as pd

data = {
    "user_id": [101, 102, 103, 101, 104, None],
    "name": ["Alice", "Bob", "Charlie", "Alice", "D@vid", "Eve"],
    "age": [25, None, 130, 25, 40, -5],
    "amount": ["USD 1,200", "USD 350", None, "USD 1,200", "USD 99", "USD 500"],
    "timestamp": [
        "2024-01-01 10:00",
        "2024-01-02 09:30",
        "2024-01-03 14:10",
        "2024-01-04 11:00",
        None,
        "2024-01-05 08:00"
    ],
    "score": [88, 92, None, 808, 45, 200]
}

df = pd.DataFrame(data)
print(df)

   user_id     name    age     amount         timestamp  score
0    101.0    Alice   25.0  USD 1,200  2024-01-01 10:00   88.0
1    102.0      Bob    NaN    USD 350  2024-01-02 09:30   92.0
2    103.0  Charlie  130.0       None  2024-01-03 14:10    NaN
3    101.0    Alice   25.0  USD 1,200  2024-01-04 11:00  808.0
4    104.0    D@vid   40.0     USD 99              None   45.0
5      NaN      Eve   -5.0    USD 500  2024-01-05 08:00  200.0

In [28]:
df.drop_duplicates(subset=["user_id"], keep="first")

   user_id     name    age     amount         timestamp  score
0    101.0    Alice   25.0  USD 1,200  2024-01-01 10:00   88.0
1    102.0      Bob    NaN    USD 350  2024-01-02 09:30   92.0
2    103.0  Charlie  130.0       None  2024-01-03 14:10    NaN
4    104.0    D@vid   40.0     USD 99              None   45.0
5      NaN      Eve   -5.0    USD 500  2024-01-05 08:00  200.0

In [29]:
# Given a column with strings like "USD 1,200", convert it into a float.
df["amount"] = df["amount"].str.replace("USD ", "").str.replace(",","").astype(float)

In [30]:
df["amount"]

0    1200.0
1     350.0
2       NaN
3    1200.0
4      99.0
5     500.0
Name: amount, dtype: float64

In [34]:
#merge wto df 
df_full = pd.merge(df, df, on= ["user_id", "timestamp"], how= "inner")

In [35]:
df_full

,user_id,name_x,age_x,amount_x,timestamp,score_x,name_y,age_y,amount_y,score_y
0,101.0,Alice,25.0,1200.0,2024-01-01 10:00,88.0,Alice,25.0,1200.0,88.0
1,102.0,Bob,NaN,350.0,2024-01-02 09:30,92.0,Bob,NaN,350.0,92.0
2,103.0,Charlie,130.0,NaN,2024-01-03 14:10,NaN,Charlie,130.0,NaN,NaN
3,101.0,Alice,25.0,1200.0,2024-01-04 11:00,808.0,Alice,25.0,1200.0,808.0
4,104.0,D@vid,40.0,99.0,None,45.0,D@vid,40.0,99.0,45.0
5,NaN,Eve,-5.0,500.0,2024-01-05 08:00,200.0,Eve,-5.0,500.0,200.0

In [ ]:
'''Explain the difference between apply, map, applymap.
Please don’t mix these up.
map works on Series.
apply works on Series or DataFrame rows/cols.
applymap works element-wise on DataFrame.'''

'Explain the difference between apply, map, applymap.\n\nPlease don’t mix these up.\n\nmap works on Series.\n\napply works on Series or DataFrame rows/cols.\n\napplymap works element-wise on DataFrame.'

In [42]:
df["name"].apply(lambda x: x.upper())
df["name"].map(lambda x: x.upper())
#df["name"].applymap(lambda x: x.upper())

0      ALICE
1        BOB
2    CHARLIE
3      ALICE
4      D@VID
5        EVE
Name: name, dtype: object

In [48]:
# outliers df[np.abs((df["col"] - df["col"].mean()) / df["col"].std()) > 3]
df_full.groupby("user_id")["age_x"].sum()

user_id
101.0     50.0
102.0      0.0
103.0    130.0
104.0     40.0
Name: age_x, dtype: float64

In [49]:
df = df[(df["age"] >= 0) & (df["age"] <= 120)]

In [50]:
df

   user_id   name   age  amount         timestamp  score
0    101.0  Alice  25.0  1200.0  2024-01-01 10:00   88.0
3    101.0  Alice  25.0  1200.0  2024-01-04 11:00  808.0
4    104.0  D@vid  40.0    99.0              None   45.0

In [ ]:
# for chunk in pd.read_csv("big.csv", chunksize=500000):
#     process(chunk)
# from sklearn.preprocessing import MinMaxScaler

# df[["a","b"]] = MinMaxScaler().fit_transform(df[["a","b"]])

#Write code to detect columns with >50% missing values.
# missing_cols = df.columns[df.isna().mean() > 0.5]

In [52]:
import pandas as pd

data = {
    "user_id": [101, 102, 103, 101, 104, None],
    "name": ["Alice", "Bob", "Charlie", "Alice", "D@vid", "Eve"],
    "age": [25, None, 130, 25, 40, -5],
    "amount": ["USD 1,200", "USD 350", None, "USD 1,200", "USD 99", "USD 500"],
    "timestamp": [
        "2024-01-01 10:00",
        "2024-01-02 09:30",
        "2024-01-03 14:10",
        "2024-01-04 11:00",
        None,
        "2024-01-05 08:00"
    ],
    "score": [88, 92, None, 88, 45, 200]
}

df = pd.DataFrame(data)
print(df)

# 1 Write code to remove duplicates based on user_id and keep only the latest record using timestamp.
df.sort_values(by=["timestamp"]).drop_duplicates(subset=["user_id"], keep = "last")

   user_id     name    age     amount         timestamp  score
0    101.0    Alice   25.0  USD 1,200  2024-01-01 10:00   88.0
1    102.0      Bob    NaN    USD 350  2024-01-02 09:30   92.0
2    103.0  Charlie  130.0       None  2024-01-03 14:10    NaN
3    101.0    Alice   25.0  USD 1,200  2024-01-04 11:00   88.0
4    104.0    D@vid   40.0     USD 99              None   45.0
5      NaN      Eve   -5.0    USD 500  2024-01-05 08:00  200.0

   user_id     name    age     amount         timestamp  score
1    102.0      Bob    NaN    USD 350  2024-01-02 09:30   92.0
2    103.0  Charlie  130.0       None  2024-01-03 14:10    NaN
3    101.0    Alice   25.0  USD 1,200  2024-01-04 11:00   88.0
5      NaN      Eve   -5.0    USD 500  2024-01-05 08:00  200.0
4    104.0    D@vid   40.0     USD 99              None   45.0

In [59]:
# ques 2 Your DataFrame has missing values in age, score, and amount.

# drop entierly 
df.dropna()
# Impute using mean/median/mode
df["age"] =  df["age"].fillna(df["age"].mean())
df["score"] =  df["score"].fillna(df["score"].mean())
df["amount"] =  df["amount"].fillna("USD 0 ")
# forward fill or backward fill 
df_ffill = df.fillna(method="ffill")
df_bfill = df.fillna(method="bfill")

/var/folders/9t/78vgfzf94l3f7wnvfk1ng3lc0000gq/T/ipykernel_4479/2648309816.py:10: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_ffill = df.fillna(method="ffill")
/var/folders/9t/78vgfzf94l3f7wnvfk1ng3lc0000gq/T/ipykernel_4479/2648309816.py:11: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_bfill = df.fillna(method="bfill")

In [60]:
# Column amount contains strings like "USD 1,200".
# Write Python code to clean this column and convert it to float.
df["amount"] = df["amount"].str.replace("USD", "")
df["amount"] = df["amount"].str.replace(",", "")
df["amount"] = df["amount"].astype(float)

In [61]:
df2 = pd.DataFrame({
    "user_id": [101, 102, 104, 105],
    "city": ["NYC", "LA", "Chicago", "Miami"]
})

In [62]:
df_merge = pd.merge(df, df2, on="user_id", how = "inner")

In [ ]:
df_merge

   user_id   name   age  amount         timestamp  score     city
0    101.0  Alice  25.0  1200.0  2024-01-01 10:00   88.0      NYC
1    102.0    Bob  43.0   350.0  2024-01-02 09:30   92.0       LA
2    101.0  Alice  25.0  1200.0  2024-01-04 11:00   88.0      NYC
3    104.0  D@vid  40.0    99.0              None   45.0  Chicago

In [69]:
# df2 = df.applymap(lambda x: str(x).upper())
# identify |z| > 3).
import numpy as np
z = (df["age"] - df["age"].mean()) / df["age"].std()
outliers = df[np.abs(z) > 3]

In [70]:
outliers

Empty DataFrame
Columns: [user_id, name, age, amount, timestamp, score]
Index: []

In [77]:
df["timestamp"].dropna()
df["timestamp"] = pd.to_datetime(df["timestamp"], errors="coerce")

In [78]:
df_long = pd.melt(
    df,
    id_vars=["user_id"],
    var_name="variable",
    value_name="value"
)

In [83]:
#Using groupby, compute the total score per user.
df.groupby("user_id")["score"].sum()

user_id
101.0    176.0
102.0     92.0
103.0    102.6
104.0     45.0
Name: score, dtype: float64

In [90]:
df = df[(df["age"].notna()) & (df["age"]>0) & (df["age"]<120)]

In [94]:
# nested list 
res = []
lst = [1, [2, [3, 4], 5], 6]

def flatten(lst):
    for item in lst:
        if isinstance(item, list):
            yield from flatten(item)
        else:
            yield item

In [96]:
list(flatten(lst))

[1, 2, 3, 4, 5, 6]

In [105]:
from sklearn.preprocessing import MinMaxScaler
data = {
    "user_id": [101, 102, 103, 101, 104, None],
    "name": ["Alice", "Bob", "Charlie", "Alice", "D@vid", "Eve"],
    "age": [25, None, 130, 25, 40, -5],
    "amount": ["USD 1,200", "USD 350", None, "USD 1,200", "USD 99", "USD 500"],
    "timestamp": [
        "2024-01-01 10:00",
        "2024-01-02 09:30",
        "2024-01-03 14:10",
        "2024-01-04 11:00",
        None,
        "2024-01-05 08:00"
    ],
    "score": [88, 92, None, 88, 45, 200]
}

df = pd.DataFrame(data)

scaler = MinMaxScaler()
df[["age", "score"]] = scaler.fit_transform(df[["age", "score"]])
# now age and score is scaled between 0 and 1 
df

   user_id     name       age     amount         timestamp     score
0    101.0    Alice  0.222222  USD 1,200  2024-01-01 10:00  0.277419
1    102.0      Bob       NaN    USD 350  2024-01-02 09:30  0.303226
2    103.0  Charlie  1.000000       None  2024-01-03 14:10       NaN
3    101.0    Alice  0.222222  USD 1,200  2024-01-04 11:00  0.277419
4    104.0    D@vid  0.333333     USD 99              None  0.000000
5      NaN      Eve  0.000000    USD 500  2024-01-05 08:00  1.000000

In [106]:
# Detect columns in the DataFrame that have more than 50% missing values.
more_than_50 = df.columns[df.isna().mean()>0.5]

In [107]:
more_than_50

Index([], dtype='object')

In [112]:

import re 
df["clean_name"] = df["name"].apply(lambda x: re.sub(r"[^a-z]","",x.lower()))
df.drop_duplicates(subset="clean_name")

,user_id,name,age,amount,timestamp,score,clean_name
0,101.0,alice,0.222222,"USD 1,200",2024-01-01 10:00,0.277419,alice
1,102.0,bob,NaN,USD 350,2024-01-02 09:30,0.303226,bob
2,103.0,charlie,1.000000,None,2024-01-03 14:10,NaN,charlie
4,104.0,d@vid,0.333333,USD 99,None,0.000000,dvid
5,NaN,eve,0.000000,USD 500,2024-01-05 08:00,1.000000,eve

In [114]:
expected_cols = ["user_id", "name", "age", "amount", "timestamp", "score", "clean_name"]
df.columns == expected_cols

array([ True,  True,  True,  True,  True,  True,  True])

In [117]:
rules = {"age": lambda x: 0 <= x <= 120}
def validate(df, rules):
    for col, fn in rules.items():
        # If any value violates the rule → return False
        if not df[col].apply(fn).all():
            return False
    return True
validate(df, rules)

False

In [ ]:
# Feature Leakage Detection
''' You’re handed a training DataFrame for a binary classification task.
You notice a column "final_score" that is highly correlated with the target label.

How would you detect feature leakage in a dataset?
List 3 methods and give a short Python snippet for one of them. '''

# calculate the correlation between the target and the final_score
df["final_score"].corr(df["target"])
# these are labels 1 or 0 lets say so we can use a confusion matrix

from sklearn.feature_selection import mutual_info_classif

X = df.drop(columns=["target"])
y = df["target"]

mi = mutual_info_classif(X.fillna(0), y)
pd.Series(mi, index=X.columns).sort_values(ascending=False)

' You’re handed a training DataFrame for a binary classification task.\nYou notice a column "final_score" that is highly correlated with the target label.\n\nHow would you detect feature leakage in a dataset?\nList 3 methods and give a short Python snippet for one of them. '

In [119]:
'''Data Drift Detection
You have:
df_train
df_production (latest batch of real-world data)'''
# Bonus: include one Python snippet using a statistical test.
# if its a binary classification problem
from scipy.stats import chisquare
# check if the number of positive and negative samples are the same
chisquare(df["target"].value_counts())
Compare:

mean

variance

skew

kurtosis

cardinality

missingness rate

If these move too much: drift.
Compute embeddings, compare cluster centroids or pairwise distances:

Cosine distance

Wasserstein distance
from scipy.stats import ks_2samp

drift_results = {
    col: ks_2samp(df_train[col].dropna(), df_production[col].dropna())
    for col in df_train.select_dtypes(include="number").columns
}

drift_results

SyntaxError: invalid syntax (339486413.py, line 10)

In [120]:
# QUESTION 3 — Handling Imbalanced Datasets
#You have a dataset where only 1% of rows are positive samples.
#List 5 different techniques to handle extreme class imbalance
#AND provide Python code for one of them.
''' answer 
1. df["label"]==1 Random oversampling over the minority class 
2. undersampling the majority class 
3. change the loss for finetuning for example to weighted cross entropy or focal loss 
clf = LogisticRegression(class_weight="balanced")
loss = nn.BCEWithLogitsLoss(pos_weight=torch.tensor([99]))

4. Synthetic data generation (SMOTE, GANs)
5. Decision threshold tuning, Instead of using the default 0.5:Optimize F1, Optimize Recall@Precision≥90%, Optimize AUCPR
This handles imbalance without altering training data

from sklearn.utils import resample

df_min = df[df.label == 1]
df_maj = df[df.label == 0]

df_min_upsampled = resample(df_min, 
                            replace=True, 
                            n_samples=len(df_maj), 
                            random_state=42)

df_balanced = pd.concat([df_maj, df_min_upsampled])


'''

' answer \n1. df["label"]==1 Random oversampling over the minority class \n2. undersampling the majority class \n3. change the loss for finetuning for example to weighted cross entropy or focal loss \nclf = LogisticRegression(class_weight="balanced")\nloss = nn.BCEWithLogitsLoss(pos_weight=torch.tensor([99]))\n\n4. Synthetic data generation (SMOTE, GANs)\n5. Decision threshold tuning, Instead of using the default 0.5:Optimize F1, Optimize Recall@Precision≥90%, Optimize AUCPR\nThis handles imbalance without altering training data\n\nfrom sklearn.utils import resample\n\ndf_min = df[df.label == 1]\ndf_maj = df[df.label == 0]\n\ndf_min_upsampled = resample(df_min, \n                            replace=True, \n                            n_samples=len(df_maj), \n                            random_state=42)\n\ndf_balanced = pd.concat([df_maj, df_min_upsampled])\n\n\n'

In [122]:
# How do you detect and remove “label inversion” examples?**
# Label inversion = the response contradicts the instruction.
# List 3 methods to detect label inversion, and provide one Python snippet for one method.

# this is wrong perplexity measures fluency and not alignment. use a small instruct model to do question, answer and compute the perplexity. If the perplexity is unusually high, its inverted label
# 1. If embedding(prompt) and embedding(response) point in opposite semantic directions, it's a red flag.
# 2. use majority voting for multiple model as a judge and seperate the sampples which have the maximum votes. 
# 3. not sure NLI/keyword-based contradiction detection. Any sample flagged by these methods is removed or corrected.

In [123]:
# Ques2. Filtering Harmful or Unwanted Content in SFT Data
#Detecting and Removing “Model-Written Data” From a Supposedly Human Dataset
#You are given 500k instruction–response samples labeled “human-written,”
# but you suspect many were generated by GPT-style models.

# 1. OpenAI uses joint metrics (entropy × perplexity) to catch highly fluent but non-human text.
# 2. Perplexity - LLM-written text often has: abnormally low perplexity, overly consistent fluency, lack of human irregularities
# 3. Entropy - LLM written text has lower token entropy, lower variance in sentence length,predictable syntactic patterns
# 4. Embedding Clustering / Outlier Detection - LLM-generated responses cluster tightly in embedding space because they:share structure,
#  share reasoning patterns, lack human semantic noise. Technique:embed all samples, run k-means / HDBSCAN, look for dense AI-like clusters
# 5. Modern LLMs sometimes leave statistical fingerprints:uneven use of rare tokens, unnatural ratio of stopwords, 
# 6. LLMS as judge use a stronger model to label

In [124]:
# Ques3.  Building a High-Quality RLAIF Dataset
# List 6 properties of a good preference dataset AND describe 3 common failure modes that ruin RLAIF training.
# 1. Reward hacking - If preference data rewards certain surface patterns (like length), the model learns cheap hacks.
# 2.